app/controllers/flats_controller.rb

  def index
    @flats = Flat.where.not(latitude: nil, longitude: nil)
---
SELECT "flats".* FROM "flats" WHERE ("flats"."latitude" IS NOT NULL) AND ("flats"."longitude" IS NOT NULL)

  def create
    @flat = Flat.new(flat_params)

    if @flat.save
---
INSERT INTO "flats" ("name", "address", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @flat.update(flat_params)
---
UPDATE "flats" SET "address" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["address", "63, rua tremembe, Sao Paulo"], ["updated_at", 2017-06-12 20:29:05 UTC], ["id", 1]]

  def destroy
    @flat.destroy
---
DELETE FROM "flats" WHERE "flats"."id" = $1  [["id", 6]]

    def set_flat
      @flat = Flat.find(params[:id])
---
SELECT  "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]